---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
source: html/90bda330-b659-9a58-5be4-d1d8c175a7a8.htm
---
# RebarShapeConstraintSagittaLength Methods

Return the Id of the parameter associated with this constraint.